---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinEndSpanhookPrim
source: html/3b25dee2-4aa7-1aa9-dc0c-c4b7ce36945f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinEndSpanhookPrim Property

"End Hook Angle Primary"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinEndSpanhookPrim { get; }
```